// 股票打新记录
let data = [
    {
        name: '康基医疗',
        打新记录: [
            {
                券商: '富途',
                name: '康基医疗',
                打新类型: '融资打新',
                打新手数: 5,
                每手股数: 500,
                一手金额: 7009.93,
                融资利率: 0.0388,
                融资倍数: 10,
                打新日期: '2020/6/18',
                记息天数: 7,
            }
        ],
        中签记录: [
            {
                券商: '富途',
                name: '康基医疗',
                中签定价: 13.88,
                中签手数: 2,
            }
        ],
        出售记录: [
            {
                券商: '富途',
                name: '康基医疗',
                出售价格: 23.95,
                出售手数: 1,
                出售日期: '2020/6/29'
            },
            {
                券商: '富途',
                name: '康基医疗',
                出售价格: 30,
                出售手数: 1,
                出售日期: '2020/6/29'
            },
        ]
    }
]

export default data;